// ============================================================================
//
//                            Контроллеры пользователя
//
// ============================================================================

// ======================== Импортируем все необходимое =======================

// Подключаем модуль для хэширования пароля
const bcrypt = require('bcryptjs');

// Подключаем модуль для создания токена
const jwt = require('jsonwebtoken');

// импортируем модель пользователя
const User = require('../models/user');

// Импортируем переменные окружения

// Импортируем ошибки

// ----------------------------------------------------------------------------
//          Контроллер для регистрации пользователя на сайте (signup)
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
//             Контроллер для входа пользователя на сайт (signin)
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
//            Контроллер для выхода пользователя с сайта (signout)
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
//             Контроллер для получения информации о пользователе
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
//          Контроллер для обновления информации профиля пользователя
// ----------------------------------------------------------------------------